dictionary = {
    "Telegram premium": {
        'fa': "پرمیوم تلگرام",
        'ru': "Телеграм премиум",
    },
    "100% Share of ad revenue": {
        'fa': "100% سهم دلاری درآمد تبلیغات کانال",
        'ru': "100% Доля рекламного дохода",
    },
    "You have not joined the channel! {}": {
        'fa': "شما به کانال نپیوسته‌اید! {}",
        'ru': "Вы не присоединились к каналу! {}",
    },
    "Congratulations on joining! 🌟": {
        'fa': "تبریک برای پیوستن! 🌟",
        'ru': "Поздравляем с присоединением! 🌟",
    },
    "You now have a fantastic opportunity to be one of our lucky winners.": {
        'fa': "شما اکنون فرصت فوق‌العاده‌ای برای برنده شدن دارید.",
        'ru': "Теперь у вас есть фантастическая возможность стать одним из наших счастливых победителей.",
    },
    "To increase your chances, invite your friends using your personal invitation link.": {
        'fa': "برای افزایش شانس برنده شدن، دوستان خود را با استفاده از لینک دعوت شخصی خود دعوت کنید.",
        'ru': "Чтобы увеличить свои шансы, пригласите своих друзей, используя свою персональную ссылку для приглашения.",
    },
    "Simply type": {
        'fa': "فقط تایپ کنید",
        'ru': "Просто введите",
    },
    "to get your referral link and invite your friends.": {
        'fa': "برای دریافت لینک معرفی خود و دعوت دوستانتان.",
        'ru': "чтобы получить свою ссылку для приглашения и пригласить своих друзей.",
    },
    "Let's make our community bigger and better together! 🚀": {
        'fa': "بیایید با هم جامعه‌ی خود را بزرگتر و بهتر کنیم! 🚀",
        'ru': "Давайте вместе сделаем наше сообщество больше и лучше! 🚀",
    },
    "Done!": {
        'fa': "انجام شد!",
        'ru': "Готово!",
    },
    "You have successfully changed your language!": {
        'fa': "زبان شما با موفقیت تغییر یافت!",
        'ru': "Ваш язык успешно изменен!",
    },
    "You have successfully joined the channel!": {
        'fa': "شما با موفقیت به کانال پیوستید!",
        'ru': "Вы успешно присоединились к каналу!",
    },
    "The lucky 7 Community": {
        'fa': "جامعه 7 شانسی",
        'ru': "Счастливое 7 сообщество",
    },
    "Joined ✅": {
        'fa': "عضو شدم ✅",
        'ru': "Присоединился ✅",
    },
    "🚀 Exciting News! 🚀": {
        'fa': "🚀 اخبار جذاب! 🚀",
        'ru': "🚀 Увлекательные новости! 🚀",
    },
    "Starting this month, Telegram has introduced a fantastic new feature allowing channel owners to earn revenue through ads. But here’s the twist: we're giving 100% of our ad revenue back to you, our lovely community!": {
        'fa': "از این ماه، تلگرام ویژگی جدید و فوق‌العاده‌ای معرفی کرده است که به صاحبان کانال اجازه می‌دهد از طریق تبلیغات درآمد کسب کنند. اما اینجاست که ما 100% از درآمد تبلیغات خود را به شما، جامعه‌ی دوست داشتنی ما، باز می‌گردانیم!",
        'ru': "В этом месяце Telegram представил фантастическую новую функцию, позволяющую владельцам каналов зарабатывать доход от рекламы. Но вот подвох: мы отдаем вам 100% нашего рекламного дохода, нашей прекрасной сообществу!",
    },
    "Here's how it works:": {
        'fa': "اینجاست که چگونه کار می‌کند:",
        'ru': "Вот как это работает:",
    },
    "Every month, 100% of our ad revenue will be shared among 7 lucky subscribers.": {
        'fa': "هر ماه، 100% از درآمد تبلیغاتی ما بین 7 مشترک خوش‌شانس تقسیم می‌شود.",
        'ru': "Каждый месяц 100% нашего рекламного дохода будет разделено между 7 счастливыми подписчиками.",
    },
    "The winners will be selected randomly, ensuring that everyone has a fair chance to win.": {
        'fa': "برندگان به صورت تصادفی انتخاب می‌شوند، تضمین می‌شود که همه فرصت منصفانه‌ای برای برنده شدن داشته باشند.",
        'ru': "Победители будут выбраны случайным образом, обеспечивая, что у каждого есть равные шансы на победу.",
    },
    "Stay subscribed and active for your chance to be one of the lucky 7! 🤑": {
        'fa': "برای فرصت برنده شدن یکی از 7 خوش‌شانس باقی بمانید و فعال باشید! 🤑",
        'ru': "Оставайтесь подписанными и активными, чтобы иметь шанс стать одним из счастливых 7! 🤑",
    },
    "Choose your language 🌐": {
        'fa': "زبان خود را انتخاب کنید 🌐",
        'ru': "Выберите свой язык 🌐",
    },
    "🎉 Congratulations! 🎉": {
        'fa': "🎉 تبریک! 🎉",
        'ru': "🎉 Поздравляю! 🎉",
    },
    "Your friend": {
        'fa': "دوست شما",
        'ru': "Ваш друг",
    },
    "You have invited {} friends." : {
        'fa': "شما {} دوست دعوت کرده‌اید.",
        'ru': "Вы пригласили {} друзей.",
    },
    "And you have gathered": {
        'fa': "و اکنون شما",
        'ru': "И теперь у вас",
    },
    "points so far!": {
        'fa': "امتیاز جمع‌آوری کرده‌اید!",
        'ru': "баллов до сих пор!",
    },
    "joined the Bot!": {
        'fa': "به ربات پیوست.",
        'ru': "присоединился к боту.",
    },
    "Telegram channel owners can now receive 50% of ads revenue!": {
        'fa': "صاحبان کانال تلگرام اکنون می‌توانند 50% از درآمد تبلیغات را دریافت کنند!",
        'ru': "Владельцы каналов Telegram теперь могут получать 50% рекламного дохода!",
    },
    "In Lucky 7, we give back 100% of our share to the members!": {
        'fa': "در Lucky 7، ما 100% از سهم خود را به اعضا باز می‌گردانیم!",
        'ru': "В Lucky 7 мы отдаем 100% нашей доли участникам!",
    },
    "Join our channel and invite your friends to increase your chance of winning one of the 7 giveaways!": {
        'fa': "به کانال ما بپیوندید و دوستان خود را دعوت کنید تا فرصت برنده شدن یکی از 7 جایزه را افزایش دهید!",
        'ru': "Присоединяйтесь к нашему каналу и приглашайте своих друзей, чтобы увеличить свои шансы на выигрыш одного из 7 призов!",
    },
    "Welcome aboard!": {
        'fa': "خوش آمدید!",
        'ru': "Добро пожаловать на борт!",
    },
    "You are now one step closer to becoming one of the Lucky 7 winners!": {
        'fa': "شما اکنون یک گام نزدیک‌تر به تبدیل شدن به یکی از برندگان Lucky 7 هستید!",
        'ru': "Теперь вы на шаг ближе к тому, чтобы стать одним из счастливых 7 победителей!",
    },
    "To increase your chances, get your own referral link from": {
        'fa': "برای افزایش شانس‌های خود، لینک معرفی خود را از",
        'ru': "Чтобы увеличить свои шансы, получите свою собственную ссылку для приглашения из",
    },
    "and send it to as many friends you can!": {
        'fa': "بگیرید و آن را به دوستان خود ارسال کنید!",
        'ru': "и отправьте его как можно большему количеству друзей!",
    },

    "You are now ranked number {} on the leaderboard! By inviting {} more friends, you'll be ranked 1st!": {
        'fa': "شما اکنون در رتبه‌ی {} در جدول رده‌بندی هستید! با دعوت {} دوست دیگر، در رتبه‌ی اول قرار خواهید گرفت!",
        'ru': "Теперь вы находитесь на {} месте в рейтинге! Пригласив еще {} друзей, вы займете первое место!",
    },
    "Just a reminder that you should also be a member of The Lucky 7 channel in order to participate in the giveaways!": {
        'fa': "یادآوری کوچک: برای شرکت در جوایز، شما همچنین باید عضو کانال Lucky 7 باشید!",
        'ru': "Просто напоминаем, что вы также должны быть участником канала Lucky 7, чтобы принять участие в розыгрышах!",
    },
    "You are now ranked number {} on the leaderboard!" : {
        'fa': "شما اکنون در رتبه‌ی {} در جدول رده‌بندی هستید!",
        'ru': "Теперь вы находитесь на {} месте в рейтинге!",
    },
    "Keep inviting your friends to secure your spot at the top!" : {
        'fa': "به دعوت دوستان خود ادامه دهید تا جایگاه خود را در بالای جدول تضمین کنید!",
        'ru': "Продолжайте приглашать своих друзей, чтобы занять верхнюю позицию!",
    },
    "Hooray!" : {
        'fa': "هورااااا!",
        'ru': "Ура!",
    },
    "By inviting {} more friends, you will be in the top 20.": {
        'fa': "با دعوت {} دوست دیگر، در بیست رتبه بالای جدول قرار خواهید گرفت.",
        'ru': "Пригласив еще {} друзей, вы окажетесь в топ-20.",
    },
    "Get going!" : {
        'fa': "شروع کنید!",
        'ru': "Поехали!",
    },
    "You need to invite at least 7 friends in order to participate in the contest and be ranked.": {
        'fa': "برای شرکت در مسابقه و رتبه‌بندی حداقل 7 دوست را باید دعوت کنید.",
        'ru': "Чтобы принять участие в конкурсе и быть в рейтинге, вам нужно пригласить как минимум 7 друзей.",
    },
    "Get started!": {
        'fa': "شروع کنید!",
        'ru': "Начните!",
    },
}


def get_text(language_code: str, key: str) -> str:
    return dictionary.get(key, {}).get(language_code, key)
